Autodesk.Revit.DB.Structure.ReinforcementBarOrientation
Describes the bar orientation at Path Reinforcement.
Since:
2016
Since:
2016

Autodesk.Revit.DB.Structure.ReinforcementBarOrientation.FarSide
The major segment of the bar is on the side edge far from the Path Reinforcement sketch line.

Autodesk.Revit.DB.Structure.ReinforcementBarOrientation.BottomOrInterior
The major segment of the bar is on the bottom face (of a floor/slab) or the interior face (of a wall).

Autodesk.Revit.DB.Structure.ReinforcementBarOrientation.NearSide
The major segment of the bar is on the side edge near to the Path Reinforcement sketch line.

Autodesk.Revit.DB.Structure.ReinforcementBarOrientation.TopOrExterior
The major segment of the bar is on the top face (of a floor/slab) or the exterior face (of a wall).